package com.deposits.ui;

/**
 * Інтерфейс Команди (Command Interface).
 * * Це "контракт", який зобов'язані виконувати (implements) усі класи,
 * які хочуть бути пунктами меню (ZnaytyVkladCommand, VykhidCommand тощо).
 * * Меню (KonsolneMenyu) працює тільки з цим інтерфейсом. Воно не знає,
 * що всередині конкретних класів, воно знає тільки те, що їх можна "виконати"
 * і запитати у них "ім'я".
 */
public interface Command {

    /**
     * Головний метод "ПУСК".
     * * Коли користувач обирає пункт меню (наприклад, натискає "1"),
     * клас KonsolneMenyu викликає цей метод.
     * * Всередині цього методу конкретна команда звертається до Сервісу (Receiver)
     * і каже йому виконати роботу (наприклад, servis.pidibratyVklady()).
     */
    void execute();

    /**
     * Метод для отримання назви пункту меню.
     * * Меню використовує його, щоб вивести гарний список на екран:
     * 1. Знайти вклад (Помічник)  <-- це текст, який повертає getName()
     * 2. Вихід
     * * @return Текстова назва команди для користувача.
     */
    String getName();
}